#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_service_account.ci-lilurl: Refreshing state... [id=projects/url-generator-438113/serviceAccounts/ci-lilurl@url-generator-438113.iam.gserviceaccount.com]
google_storage_bucket.tf-state-bucket: Refreshing state... [id=tf-state-bucket-438113]
google_iam_workload_identity_pool.github-wif-pool: Refreshing state... [id=projects/url-generator-438113/locations/global/workloadIdentityPools/github-wif]
google_service_account.ci-terraform: Refreshing state... [id=projects/url-generator-438113/serviceAccounts/ci-terraform@url-generator-438113.iam.gserviceaccount.com]
google_project_iam_member.lilurl-access: Refreshing state... [id=url-generator-438113/roles/compute.admin/serviceAccount:ci-lilurl@url-generator-438113.iam.gserviceaccount.com]
google_service_account_iam_member.lilurl-wiu: Refreshing state... [id=projects/url-generator-438113/serviceAccounts/ci-lilurl@url-generator-438113.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/564701988502/locations/global/workloadIdentityPools/github-wif/attribute.repository/pansachin/lilurl]
google_service_account_iam_member.lilurl-iac-wiu: Refreshing state... [id=projects/url-generator-438113/serviceAccounts/ci-terraform@url-generator-438113.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/564701988502/locations/global/workloadIdentityPools/github-wif/attribute.repository/pansachin/lilurl-iac]
google_project_iam_member.project-owner: Refreshing state... [id=url-generator-438113/roles/owner/serviceAccount:ci-terraform@url-generator-438113.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.github-provider: Refreshing state... [id=projects/url-generator-438113/locations/global/workloadIdentityPools/github-wif/providers/github-provider]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.lilurl will be created
  + resource "google_artifact_registry_repository" "lilurl" {
      + create_time      = (known after apply)
      + description      = "Lilurl repository"
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "us-central1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "url-generator-438113"
      + repository_id    = "lilurl"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)
    }

  # google_project_service.service["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "url-generator-438113"
      + service            = "artifactregistry.googleapis.com"
    }

  # google_project_service.service["cloudbuild.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "url-generator-438113"
      + service            = "cloudbuild.googleapis.com"
    }

  # google_project_service.service["clouderrorreporting.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "url-generator-438113"
      + service            = "clouderrorreporting.googleapis.com"
    }

  # google_project_service.service["cloudfunctions.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "url-generator-438113"
      + service            = "cloudfunctions.googleapis.com"
    }

  # google_project_service.service["cloudkms.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "url-generator-438113"
      + service            = "cloudkms.googleapis.com"
    }

  # google_project_service.service["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "url-generator-438113"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.service["cloudscheduler.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "url-generator-438113"
      + service            = "cloudscheduler.googleapis.com"
    }

  # google_project_service.service["cloudtrace.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "url-generator-438113"
      + service            = "cloudtrace.googleapis.com"
    }

  # google_project_service.service["container.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "url-generator-438113"
      + service            = "container.googleapis.com"
    }

  # google_project_service.service["dns.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "url-generator-438113"
      + service            = "dns.googleapis.com"
    }

  # google_project_service.service["iam.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "url-generator-438113"
      + service            = "iam.googleapis.com"
    }

  # google_project_service.service["logging.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "url-generator-438113"
      + service            = "logging.googleapis.com"
    }

  # google_project_service.service["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "url-generator-438113"
      + service            = "monitoring.googleapis.com"
    }

  # google_project_service.service["run.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "url-generator-438113"
      + service            = "run.googleapis.com"
    }

  # google_project_service.service["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "url-generator-438113"
      + service            = "secretmanager.googleapis.com"
    }

  # google_project_service.service["sql-component.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "url-generator-438113"
      + service            = "sql-component.googleapis.com"
    }

  # google_project_service.service["sqladmin.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "url-generator-438113"
      + service            = "sqladmin.googleapis.com"
    }

  # google_project_service.service["stackdriver.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "url-generator-438113"
      + service            = "stackdriver.googleapis.com"
    }

Plan: 19 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @pansachin, Action: `pull_request`, Workflow: `Plan & Apply`*